Revit 2026 API

# ClosestPointsPairBetweenTwoCurves(ClosestPointsPairBetweenTwoCurves) Constructor

---

Creates a copy of the ClosestPointsPairBetweenTwoCurves.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ClosestPointsPairBetweenTwoCurves(
	ClosestPointsPairBetweenTwoCurves other
)
```
```vb
Public Sub New (
	other As ClosestPointsPairBetweenTwoCurves
)
```
```cpp
public:
ClosestPointsPairBetweenTwoCurves(
	ClosestPointsPairBetweenTwoCurves^ other
)
```
```fsharp
new :
        other : ClosestPointsPairBetweenTwoCurves -> ClosestPointsPairBetweenTwoCurves
```

#### Parameters

other ClosestPointsPairBetweenTwoCurves

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ClosestPointsPairBetweenTwoCurves Class

ClosestPointsPairBetweenTwoCurves Overload

Autodesk.Revit.DB Namespace